# 过滤缺失值

dropna()

## 1. 过滤缺失值(Series)

In [2]:
import numpy as np
import pandas as pd

In [2]:
from numpy import nan as NA

In [3]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

## 2. 过滤缺失值(DataFrame)

In [10]:
df = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                 [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = df.dropna()

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
df.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df[4]=NA

In [19]:
df

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
df.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

## 过滤thresh

In [24]:
df2 = pd.DataFrame(np.random.randn(7, 3))

In [27]:
df2.iloc[:4, 1] = NA

In [28]:
df2.iloc[:2, 2] = NA

In [30]:
df2.iloc[:1, 0] = NA

In [35]:
df2

          0         1         2
0       NaN       NaN       NaN
1 -1.431415       NaN       NaN
2 -0.490505       NaN -0.972433
3 -0.010548       NaN -0.851187
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

In [32]:
df2.dropna()

          0         1         2
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

In [34]:
df2.dropna(thresh=2)

          0         1         2
2 -0.490505       NaN -0.972433
3 -0.010548       NaN -0.851187
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

In [36]:
df2.dropna(thresh=3)

          0         1         2
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

In [37]:
df2.dropna(thresh=1)

          0         1         2
1 -1.431415       NaN       NaN
2 -0.490505       NaN -0.972433
3 -0.010548       NaN -0.851187
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

<br>

## 过滤异常值

In [3]:
data2 = pd.DataFrame(np.random.randn(1000, 4)) # 1000 * 4

In [5]:
data2.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.023257    -0.004367    -0.048793     0.048669
std       1.002324     0.975056     0.962531     0.998814
min      -2.975897    -2.515078    -2.778940    -2.767317
25%      -0.600241    -0.687939    -0.728620    -0.638818
50%       0.017820    -0.064037    -0.023435     0.037827
75%       0.695162     0.695309     0.583707     0.735671
max       3.285162     3.467619     3.495247     3.305910

## 找出一列中绝对值大于三的值

In [10]:
col = data2[0]
col[np.abs(col)>3]

247    3.285162
497    3.087342
Name: 0, dtype: float64

## 找出所有值大于3 或 小于-3的 行

In [13]:
data2[(np.abs(data2) > 3).any(1)]

            0         1         2         3
108  0.468180  3.147153 -0.188581 -1.270411
247  3.285162 -0.434279 -1.695953 -0.258822
409 -1.279410  0.537989  0.483499  3.088037
459  1.190925  3.467619  1.739601 -1.108778
463 -1.730079 -1.471566  3.495247  2.892337
497  3.087342 -0.297694  0.496733  1.663982
757 -0.614587 -1.904853  0.571040  3.305910
923 -1.062985  3.001474  0.308118  0.998864

## 把绝对值大于3 的数 ----> 转成3|-3

In [17]:
data2[(np.abs(data2) > 3)] = np.sign(data2) * 3

In [18]:
data2.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.022885    -0.004983    -0.049288     0.048275
std       1.001172     0.973030     0.960831     0.997597
min      -2.975897    -2.515078    -2.778940    -2.767317
25%      -0.600241    -0.687939    -0.728620    -0.638818
50%       0.017820    -0.064037    -0.023435     0.037827
75%       0.695162     0.695309     0.583707     0.735671
max       3.000000     3.000000     3.000000     3.000000

In [19]:
np.sign(data2).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3  1.0  1.0  1.0 -1.0
4 -1.0  1.0  1.0  1.0

In [20]:
data2.head()

          0         1         2         3
0  0.757615  0.726090  0.593284 -0.186370
1  1.003538 -0.758928  0.702394  0.109721
2  1.468725  0.215300  0.018005 -0.182333
3  0.575547  1.176035  0.091834 -0.577326
4 -0.656265  0.227388  0.183606  1.629515

In [25]:
data2[(np.abs(data2) == 3)].iloc[923]

0    NaN
1    3.0
2    NaN
3    NaN
Name: 923, dtype: float64